{
  "entry": "\n   ",
  "title": "A Few Suggestions To Bring GitHub More Users And Money",
  "link": "http://www.themarkphillips.com//2011/03/31/A-Few-Suggestions-For-GitHub.html",
  "guid": "http://www.themarkphillips.com//2011/03/31/A-Few-Suggestions-For-GitHub.html",
  "updated": "2011-03-31T00:00:00-07:00",
  "pubdate": "2011-03-31T07:00:00.000Z",
  "rfc822": "Thu, 31 Mar 2011 00:00:00 -0700",
  "id": "http://www.themarkphillips.com//2011/03/31/A-Few-Suggestions-For-GitHub",
  "description": "<p class=\"date\">March 30, 2011</p>\n<p><a href=\"http://www.basho.com/\">Basho</a> uses GitHub for the hosting and development of all our code. We do this because we enjoy using git as a version control system, but also (and probably more so) for GitHub&#8217;s &#8220;social coding&#8221; advantages. (Basho <a href=\"http://blog.basho.com/2010/11/11/a-few-more-details-on-why-we-switched-to-github/\">made the switch to GitHub officially</a> back in October of last year.) In my opinion, there is simply no better way to enable more people to collaborate faster on a project than by using GitHub. If you&#8217;re at all interested in developing your software with people other than those who are paid to write it, this is where your code needs to be. (Open Source aside, you should be using GitHub for all your software development.)</p>\n<p>But I&#8217;m not a Developer. I&#8217;m a Community Manager. My long days and sleepless nights aren&#8217;t spent writing code. Instead, I&#8217;m tasked explicitly with monitoring, tracking and growing the open source activity that exists around projects like <a href=\"https://github.com/basho/riak\">Riak</a>, <a href=\"https://github.com/basho/webmachine\">Webmachine</a>, <a href=\"https://github.com/basho/riak_search\">Riak Search</a>, and <a href=\"https://github.com/basho/rebar\">Rebar</a>. That said, GitHub is one of the most effective, reliable, and innovative resources I have for watching who is doing what to contribute to our code and how they are doing it.</p>\n<p>There is, however, room for improvement. GitHub currently does a less-than-stellar job of displaying who is contributing to, watching, forking and commenting on your code. For example, I can get a straightforward snapshot of all the <a href=\"https://github.com/basho/luwak/contributors\">contributors to Luwak</a> or all the <a href=\"https://github.com/seancribbs/ripple/commits/master\">commits rolling into Ripple</a>. But, at the end of the week/month/year, when I attempt to calculate the various community growth metrics that matter to me as a Community Manager, I have to jump through some hoops. These barriers aren&#8217;t insurmountable by any means, but it could be simplified. And I would happily pay for this simplification. With that in mind, here are a few suggestions from someone who spends too much time on GitHub.</p>\n<p><strong>Suggestion 1: Snapshot of Total Activity Across a Repo</strong></p>\n<p>I do my best to track everything associated with our code. At the end of the month, for example, I&#8217;ll go to the <a href=\"https://github.com/basho/riak/\">Riak Repo</a> (and most other Basho repos, actually) and tally up things like total number of pull requests opened/closed, total number of issues opened/closed, and total number of comments open/closed, etc. One view that presented me with all this info would be insanely useful. Here&#8217;s a rundown of what might be part of said view:</p>\n<ul>\n\t<li>Total Number of Watchers/Forks</li>\n\t<li>Increase in Watchers/Forks\n\t<ul>\n\t\t<li>Percentage growth</li>\n\t\t<li>Raw Number Increase</li>\n\t</ul></li>\n\t<li>Pull Request Summary</li>\n\t<li>Commit Summary</li>\n\t<li>Comments Summary</li>\n\t<li>Issue Summary</li>\n\t<li>Number of Related Repos that Appeared This Week/Month</li>\n</ul>\n<p>More on this last bullet point: I think it would be amazing to show a list of projects that appeared over the last week/month/year that were somehow related to a given repo. Perhaps developers could tag new (or existing) repos with a some simple metadata that could be used to connect it to relevant repos. <a href=\"https://github.com/frank06/riak-js\">Riak-js</a>, for example, would get &#8220;riak&#8221; and &#8220;node.js&#8221; tags. Queue graph creation, repo impact analyses, blog posts, etc.</p>\n<p>Also, the ability to break these stats down by official members of an Organization compared to outside contributors would be essential.</p>\n<p><strong>Suggestion 2: Snapshot of Total Activity Across Every Repo Owned by an Organization or User</strong></p>\n<p>Above I mentioned that I maintain stats on basically <a href=\"https://github.com/basho\">all of Basho&#8217;s of repositories</a>. The ability to sum stats and view trends across all our of repos would trigger a deluge of happy tears. (Bonus points for giving me the ability to compare activity across a subset our repos over a given period of time.)</p>\n<p><strong>Suggestion 3: Developer Activity Snapshots at the Repo Level</strong></p>\n<p>Show me a rolled up summary for all the activity of one developer at the repository level. At the moment you can get a complete view of <a href=\"https://github.com/obie\">one user&#8217;s total activity</a>, but this lacks specificity. At the repo level I can bounce around to the separate commit, issue, and pull request screens and, via some manual filtering and incantations, figure out how a certain hacker has impacted a chunk of code. But it&#8217;s not easy and it&#8217;s not efficient. Here&#8217;s what the structure of such a page might looks like:</p>\n<ul>\n\t<li>Last visited repo on:</li>\n\t<li>Watcher/Forker Since:</li>\n\t<li>Pull Requests</li>\n\t<li>Commits</li>\n\t<li>Recent Comments</li>\n\t<li>Issues Opened/Particpated In:</li>\n\t<li>Something Cool I&#8217;m Forgetting</li>\n</ul>\n<p>(The one immediate flaw I can see here is that there would be a lot users whose repo-level activity pages would be bare. Perhaps this page would only be created one a user has satisfied several criteria?)</p>\n<p><strong>So Why Would GitHub Want To Do This?</strong></p>\n<p>GitHub does expose a few metrics that can be useful (and I&#8217;ve heard rumors that they are working to make them more useful). Both Impact and Traffic Graphs (see respective examples <a href=\"https://github.com/joyent/node/graphs/impact\">here</a> and <a href=\"https://github.com/joyent/node/graphs/traffic\">here</a>) can provide some level of depth to show who is pushing the code forward and what level of exposure your code is getting. And, it is possible to get an handle on how many commits are coming from whom. But if the repo-level metrics were to be simplified and enhanced, GitHub would see not only a lot more people using its platform, but a lot more people with different titles paying for it.</p>\n<p><em>Update</em>: <a href=\"http://news.ycombinator.com/item?id=2393327\">Link to Hacker News Comment Thread</a></p>\n<p><a href=\"https://twitter.com/pharkmillups\">Phark</a></p>",
  "isoTimestamp": "2011-03-31T07:00:00.000Z",
  "_id": "2011-03-31T07:00:00.000Z-themarkphillips",
  "site": {
    "feed": "http://themarkphillips.com/atom.xml",
    "author": "Mark Phillips",
    "link": "http://themarkphillips.com"
  },
  "displayDate": "Mar 31 2011"
}