{
  "enclosures": [],
  "title": "Now Powered by Blogofile",
  "link": "http://buffered.io/2011/02/15/now-powered-by-blogofile/",
  "pubdate": "2011-02-16T01:44:05.000Z",
  "rfc822": "Tue, 15 Feb 2011 17:44:05 -0800",
  "category": "Blogging",
  "guid": "http://buffered.io/2011/02/15/now-powered-by-blogofile/",
  "description": "<p><a href=\"http://buffered.io/uploads/2011/02/V8SFIEngine2001.jpg\" title=\"Time for a new engine\" rel=\"lightbox\"><img src=\"http://buffered.io/uploads/2011/02/V8SFIEngine2001.jpg\" width=\"150\" style=\"float:right;margin-left:5px;margin-bottom:5px;\" alt=\"Time for a new engine\"/></a>When I <a href=\"http://buffered.io/2006/09/10/office-registration-and-activation/\">first started blogging</a> back in 2006 the platform of choice at the time was <a href=\"http://wordpress.org/\">Wordpress</a>, a feature-rich blogging platform build with <a href=\"http://www.php.net/\">PHP</a>. Since then the platform has improved substantially and the number of community-driven contributions and plug-ins has increased to a massive number. I've thoroughly enjoyed using Wordpress for the past 5 years and would recommend it to anyone (I already have!) who is looking for a quality blogging platform.</p>\n<p>For me, however, Wordpress was becoming less and less appealing. This isn't due to a failing in the platform itself, but more because my needs/desires for my blogging engine were changing. <!--more--></p>\n<p>One of the curses of maintaining a technical blog is that the posts very quickly \"expire\". Their use-by date can be very short, and hence it becomes a burden to keep them up to date. So far, I've not done a great job of updating my posts, partly due to laziness, and partly because doing it using Wordpress is a little painful. I was looking for a solution to this problem, and nothing that I could see coming out of the Wordpress community was helping. What I really wanted was to have instant access to posts on my file system, not via a web front-end. Ideally, I would be able to store all of my posts in a <a href=\"http://hg-scm.org/\">Mercurial</a> repository.</p>\n<p>I was also tired of having to write posts using straight HTML. I am not a fan of using online editors. Browsers are unpredictable and a stray keystroke can move you from your page to another page, resulting in you losing anything that hasn't been saved along the way. Also, the editors are terrible, relatively featureless and often buggy. Wordpress's editor, while very good, is not my cup of tea. It was getting to the point where I really wanted to write my posts in <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> instead. I am aware of some plug-ins which allow this kind of functionality, but my experiences with them weren't that great. I wanted to write things in VIM and easily save/publish to the site without having to leave VIM.</p>\n<p>Recently I have received offers of help in updating content from other people in the technical community. They have been interested in getting access to the content so they can contribute in keeping it up to date. Providing access to these people would be painful using Wordpress as a tool. Not because it doesn't do access control, but because the workflow is just unpleasant. Ultimately the ideal scenario is to store my Mercurial repository, with all the posts in it, on <a href=\"http://bitbucket.org/\">Bitbucket</a> so that other people can fork the repository, make changes and submit <a href=\"http://confluence.atlassian.com/display/BITBUCKET/Forking+a+Bitbucket+Repository\">pull requests</a> when they have modified the content. I could easily merge the changes and republish my site.</p>\n<p>Apart from the workflow and technical reasons, I was very interested in changing the way the site was served. The blog content is totally static except for two cases, both of which can be handled externally:</p>\n<ul>\n<li>Comments - for a while I've been using <a href=\"http://disqus.com/\">Disqus</a> to handle my comments. The platform is awesome. No spam, no need to get people to sign in to comment, no overhead. Can't recommend it enough.</li>\n<li>Post updates - posts are updated by me and only me. All I needed was a way of converting my posts to a static HTML website and then copying that to my webserver.</li>\n</ul>\n<p>Since I had no need for a <em>dynamic</em> site, I could easily move away from PHP and database-driven content. All I needed was a bit of help.</p>\n<h2>Enter Blogofile</h2>\n<blockquote>\n<p>Blogofile is a static website compiler, primarily (though not exclusively) designed to be a simple blogging engine. It requires no database and no special hosting environment. You customize a set of templates with Mako, create posts in a markup language of your choice (see Post Content) and Blogofile renders your entire website as static HTML and Atom/RSS feeds which you can then upload to any old web server you like.</p>\n</blockquote>\n<p>Exactly what I need! I'm no <a href=\"http://www.python.org/\">Python</a> guru, but I knew I had enough coding chops to pick up the essentials to hack together a template which would suit my needs. I decided to dive in. My plan was:</p>\n<ul>\n<li>Port my current WP theme to Blogofile (which uses <a href=\"http://www.makotemplates.org/\">Mako</a> behind the scenes).</li>\n<li>Hack the engine a little to include:<ul>\n<li>OpenID delegation support</li>\n<li>Feedburner support</li>\n<li>Google Analytics integration</li>\n<li>Series support</li>\n</ul>\n</li>\n<li>Get a <a href=\"http://aws.amazon.com/free/\">free Micro instance</a> running on <a href=\"http://aws.amazon.com/ec2/\">EC2</a> with <a href=\"http://www.python.org/\">Python</a> and <a href=\"http://hg-scm.org/\">Mercurial</a> installed.</li>\n<li>Set up a Mercurial hook which regenerates the site and makes it available to the public when content is pushed to the repository.</li>\n<li>Migrate the content from the WP site to a set of Markdown posts.</li>\n<li>Fix links/images/etc from the previous posts and include them in the new site content.</li>\n<li>Hack a few other things to make sure the content looks relatively similar, including the support for the <code>&lt;!--more--&gt;</code> tag (which splits posts in WP).</li>\n</ul>\n<p>It will come as no surprise that I had to learn a little bit along the way :) I'm now exposed to how Python hangs together, and I have a (relatively) solid grasp of Mako templates.</p>\n<p>The net result is the site that you're now looking at! From my side of the planet the speed different is noticable, and the experience of publishing to it is as simple as <code>hg commit -m \"message\" &amp;&amp; hg push web</code> - I don't have to leave VIM at all to do that. All of my goals have been met, and I'm happy :)</p>\n<p>Now this task is out of the way, I'll be continuing work on my <a href=\"http://buffered.io/series/web-development-with-erlang/\">Erlang blog series</a>. I'm looking forward to having the next post done and ready for your critique.</p>\n<p>For those of you considering other blogging platforms which suit different workflows better than the mainstream options, be sure to check <a href=\"http://blogofile.com/\">Blogofile</a> out. It's a great system, and worth the effort of diving into. I'm happy to answer questions if you have any.</p>\n<p>Until next time!</p>",
  "isoTimestamp": "2011-02-16T01:44:05.000Z",
  "_id": "2011-02-16T01:44:05.000Z-OJs Rants",
  "site": {
    "feed": "http://buffered.io/feed/index.xml",
    "author": "OJ Reeves",
    "link": "http://buffered.io/"
  },
  "displayDate": "Feb 15 2011"
}