{
  "title": "A Cost/Benefit Analysis of the Ripple Hackathon",
  "link": "http://www.themarkphillips.com//2011/08/09/A-Cost-Benefit-Analysis-of-the-Ruby-Hackathon.html",
  "guid": "http://www.themarkphillips.com//2011/08/09/A-Cost-Benefit-Analysis-of-the-Ruby-Hackathon.html",
  "updated": "2011-08-09T00:00:00-07:00",
  "pubdate": "2011-08-09T07:00:00.000Z",
  "rfc822": "Tue, 09 Aug 2011 00:00:00 -0700",
  "id": "http://www.themarkphillips.com//2011/08/09/A-Cost-Benefit-Analysis-of-the-Ruby-Hackathon",
  "description": "<p><em><strong>August 09, 2011</strong></em></p>\n<p>From July 11 &#8211; 13, Basho Developer Advocate <a href=\"https://twitter.com/#!/seancribbs\">Sean Cribbs</a> and the majority of the <a href=\"https://github.com/seancribbs/ripple\">Ripple</a> Committers descended upon <a href=\"http://blog.basho.com/2011/06/07/BashoWest-is-all-new-and-we-have-desks-for-you/\">BashoWest</a> for the first official Ripple Hackathon (RH). This was three full days of intense work, discussion, and collaboration around <a href=\"http:wiki.basho.com\">Riak&#39;s</a> Ruby Client. After the event was over we took some time to put together a &#8220;cost/benefit analysis&#8221; to demonstrate that what we did was worthwhile and should be repeated in the future. This was my first experience with this type of community event and I learned tons. Thus, I thought it might be worth sharing with others who are focused on community building and open source software.</p>\n<p><strong>Background</strong></p>\n<p>Sean is the primary maintainer and hacker on Ripple. Due to various forces, however, he has had less time of late to work on the code, and the schedule for getting it to 1.0 continues to get drawn out.</p>\n<p>Getting Ripple to 1.0, and the features and bug fixes that come along with that version number, is something that needs to happen. The maturity and functionality of a 1.0 release means more developers and companies can use Ripple for their production deployments. To expedite the process Sean proposed we get all the Committers out to San Francisco to try and accomplish this with a sprint. And, to sweeten the pot for the invitees, we offered to pay both their airfare and hotel bills. It was a non-trivial expense from the Community budget but we felt strongly about sponsoring this development.</p>\n<p>Before this Cost/Benefit analysis was completed, Sean and I concluded that the Hackathon was a huge success: the new Ripple code, bug fixes, the community goodwil, and non-code content produced are already having a positive impact for Ripple, Riak, and the Basho Community. And, after completing this analysis, I&#39;m happy to report that event was well worth it. Here&#39;s an overview of the people involved, the code written, and why the Ripple Hackathon was an excellent investment of Basho money and time.</p>\n<p><em>Note: I originally wrote this to be consumed internally by various people at Basho. As such, I included exact dollar amounts to better demonstrate how valuable this exercise was. In preparation for public consumption, however, I&#39;ve removed these figures. That said, I&#39;m fairly confident I can demonstrate the benefit of this in relative terms.</em></p>\n<p><strong>The Committers</strong></p>\n<p>Aside from Sean, the Committes who were able to attend the Hackathon were:</p>\n<ul>\n\t<li><a href=\"https://twitter.com/duffomelia\">Duff O&#39;Melia</a> (Developer, <a href=\"http://spreedly.com/\">Spreedly</a>)</li>\n\t<li><a href=\"https://twitter.com/#!/ntalbott\">Nathaniel Talbott</a> (Cofounder, <a href=\"http://spreedly.com/\">Spreedly</a>)</li>\n\t<li><a href=\"https://twitter.com/#!/myronmarston\">Myron Marston</a> (Developer, <a href=\"http://www.seomoz.org/\">SEOmoz</a>)</li>\n\t<li><a href=\"https://twitter.com/#!/aphyr\">Kyle Kingsbury</a> (Developer, <a href=\"http://vodpod.com/\">VodPod</a>)</li>\n</ul>\n<p><strong>The Costs</strong></p>\n<p>Basho covered the majority of the expenses for each of the invitees: hotel, airfare and daily lunches were paid for out of our 2011 Community Budget.</p>\n<p><strong>Time Spent Hacking</strong></p>\n<p>Over the three day period, we estimated that four of the five hackers present put in, on average, a total of 30 hours each. One participant had to leave to handle some work issues, and was only able to contribute about 25 total hours.</p>\n<ul>\n\t<li>Total hours spent working on Ripple = 145 hours</li>\n</ul>\n<p><strong>Impact On The Code Base</strong></p>\n<p>In short, the work done, both in quality and amount, was massive. Day One was spent primarily strategizing and discussing what was to be accomplished over the next few days. Days Two and Three were where the majority of the code was written. For a full list of what happened over the three day period, take a few minutes to read Sean&#39;s detailed blog posts summarizing their goals and progress:</p>\n<ul>\n\t<li><a href=\"http://seancribbs.com/tech/2011/07/12/ripple-hackathon---day-1\">Ripple Hackathon Day One</a></li>\n\t<li><a href=\"http://seancribbs.com/tech/2011/07/13/ripple-hackathon---day-2\">Ripple Hackathon Day Two</a></li>\n\t<li><a href=\"http://seancribbs.com/tech/2011/07/14/ripple-hackathon---day-3\">Ripple Hackathon Day Three</a></li>\n</ul>\n<p>Some specific stats on the sheer volume of the work:</p>\n<ul>\n\t<li>There were 72 commits made over the three day period</li>\n\t<li>101 files were changed</li>\n\t<li>1,460 <span class=\"caps\">LOC</span> were added</li>\n\t<li>240 <span class=\"caps\">LOC</span> were deleted</li>\n</ul>\n<p>For the details on all the commits, see this <a href=\"https://github.com/seancribbs/ripple/compare/66bf4f7b2d9e1bbeb55e...59cf2624524a87ce45c4\">Compare view of the GitHub Commit Log</a>.</p>\n<p>The <a href=\"https://github.com/seancribbs/ripple/graphs/impact\">GitHub Impact Graph for Ripple</a> gives another perspective on just how much work was done (the week of July 10th, 2011 is what you&#39;ll want to examine). What this shows is that there were only five other weeks during the last 18 months that had equal or more impact on the code base. What&#39;s more, three of those five weeks were when Sean was more-or-less working full time on Ripple; he is far from full time on Ripple now.</p>\n<p><strong>Was Is Worth The Time?</strong></p>\n<p>Sean spends about 20 hours a month on Ripple at the moment. This means that it would have taken him more than seven months alone (assuming a 40 hour work week) to accomplish the equivalent of what he and the committers completed at the Hackathon. Realistically, it might have taken closer to three or four months as there are other committers and community members working with him on the library. So let&#39;s assume three months. <em>Sean and the Committers were able to accomplish in three days what would have probably taken more than three months.</em></p>\n<p><strong>Was It Worth The Money?</strong></p>\n<p>Based on Sean&#39;s effective hourly rate for the what he gets paid to work at Basho (taking into account salary, benefits, etc.), we know (with a fair amount of accuracy), what it would cost Basho to put 145 hours towards Ripple. After calculating the cost to cover all the Committer expenses (listed above), <em>we brought down the cost of development by more than 17% on an hourly basis</em>.</p>\n<p><strong>The Big Picture</strong></p>\n<p>The Ripple Hackathon was a huge success in just about every way possible, and the benefits far outweighed the costs:</p>\n<ul>\n\t<li>We wrote better code faster for Ripple (doing three months work in three days), thus making the library more mature in less time and making it more accessible to more users (both open source and commercial)</li>\n\t<li>We deepened relationships with our core committers, making them more likely to deploy Riak in other parts of their organizations and recommend it farther afield</li>\n\t<li>We decreased our development costs by more than 17%/hour during the Hackathon</li>\n\t<li>We increased Basho&#39;s community goodwill, reputation, and attention in the open source space</li>\n</ul>\n<p>This type of event is something I would like to replicate in the future in other language groups across Riak&#39;s community. The merit of such an exercise is usually pretty clear to developers partaking in it and community members observing it, but C-Level executives deal in ROIs, and Basho&#39;s (to their credit) are no different.</p>\n<p>Calculating the value of code contributions in terms of money saved and developer productivity gained is hard (and if someone has a clean, proven model on how to do so, let me know in the comments and I&#39;ll give you my cell number because we need to talk). In a controlled situation, like with the Ripple Hackathon, it&#39;s a touch easier to derive some semi-reliable numbers on things like <span class=\"caps\">ROI</span> and code impact. And with results like this in hand I&#39;m looking forward to making recommendations for similar hackathons and sprints in the near future. I&#39;m thinking Python&#8230;</p>\n<p><a href=\"https://twitter.com/#!/pharkmillups\">Mark</a></p>",
  "isoTimestamp": "2011-08-09T07:00:00.000Z",
  "_id": "2011-08-09T07:00:00.000Z-themarkphillips",
  "site": {
    "feed": "http://themarkphillips.com/atom.xml",
    "author": "Mark Phillips",
    "link": "http://themarkphillips.com"
  },
  "displayDate": "Aug 9 2011"
}