{
  "enclosures": [],
  "title": "CorrugatedIron Update - v0.1.1",
  "link": "http://buffered.io/posts/corrugatediron-update-v0-1-1",
  "pubdate": "2011-08-04T02:18:00.000Z",
  "rfc822": "Wed, 03 Aug 2011 19:18:00 -0700",
  "category": "CLR",
  "guid": "http://buffered.io/posts/corrugatediron-update-v0-1-1",
  "description": "<p>Last week <a href=\"http://facility9.com/\" title=\"Jeremiah Peschka\">JP</a> and I released our first Open Source project, <a href=\"http://corrugatediron.org/\" title=\"CorrugatedIron\">CorrugatedIron</a>. The release seemed to be fairly well received by those people who gave it a spin. We've had some good feedback along the way which we'll be evaluating, and no doubt those suggestions and comments will be influencing the future of the library.</p>\n<p>In the interim, we wanted to get another version out which sorts out two main issues and that changes the <em>perceived</em> \"norm\" when building applications with CorrugatedIron. Those issues are listed below. We've also go the first pass of our <a href=\"http://corrugatediron.org/documentation/MapReduce.html\" title=\"Map/Reduce\">Map/Reduce</a> documentation ready.</p>\n<p>If you're not interested in the detail, head on over to the <a href=\"http://corrugatediron.org/downloads.html\" title=\"Downloads page\">download page</a> to find out the many ways in which you can get access to the release. Otherwise, please read on! <!--more--></p>\n<h2 id=\"removal_of_ioc\">Removal of IoC</h2>\n<p>When we first put together the sample applications we thought that it'd be a good idea to show how these things can be done using what the mainstream .NET developers would use. That is, we decided to wire everything in with IoC. This wasn't because we felt that this is how it <strong>had</strong> to be done, but more to try and give people a level of familiarity. The library that we chose to use for the samples was Unity, for no other reason that \"it was there\".</p>\n<p>This small mistake seemed to give off the impression that we felt that Unity was the best choice of all the IoC containers out there.</p>\n<p>This is most definitely <strong>not the case</strong>. We are in no way advocating the use of one IoC container over the other. We honestly don't care which one you want to use. You should use whichever works for you.</p>\n<p>To avoid this perception we decided that it would be best to remove references to any IoC container in all samples except for the <a href=\"https://github.com/DistributedNonsense/CorrugatedIron.Samples/tree/master/VisualStudio2010/Sample\" title=\"IoC Sample Project\">one sample</a> which shows how to use <em>lots</em> of different containers to do the same thing. Hence you should see a <em>lack</em> of IoC containers in our examples from now on. Sorry for any confusion.</p>\n<h2 id=\"handling_of_client_ids\">Handling of Client IDs</h2>\n<p>Our first implementation of Client ID generation in CorrugatedIron wasn't a great implementation. We made the decision early on to generate IDs based on some details of the machine that the client was running on (ie. The MAC address of the first functioning NIC on the machine). Our thinking was that we wanted to uniquely identify a client while still allowing the ID to be reused across instances of the application. This might make sense for rich-client applications, but certainly doesn't work well in the web world. In a web environment, each request could come from a different user.</p>\n<p>Almost immediately after releasing v0.1.0, <a href=\"http://facility9.com/\" title=\"Jeremiah Peschka\">JP</a> and I read an email on the [Riak mailing list][mailinglist] which made us rethink our approach. After a bit of discussion, we decided to go with an idea of Jeremiah's which involves the generation of the Client ID when the RiakClient instance is created. This generation can be controlled by the user of the library by specifying a <code>seed</code> value.</p>\n<p>This gives the user the flexibility of not being concerned about the Client ID if they don't want to be, but can have some control if they do.</p>\n<h2 id=\"ease_of_configuration\">Ease of Configuration</h2>\n<p>The only bit of \"constructive criticism\" that we received on-masse was via <a href=\"http://news.ycombinator.com/item?id=2799823\" title=\"CI on Hacker News\">Hacker News</a> and revolved around configuration. The general feeling was that the effort required to configure the library was higher than expected, especially when compared to other libraries. I'd suggest reading the full discussion over on the <a href=\"http://news.ycombinator.com/item?id=2799823\" title=\"CI on Hacker News\">Hacker News</a> site to read some of the reasons behind the design decisions. But, if you're too lazy (I don't blame you if you are), the short version is this: CorrugatedIron is a .NET library connecting to a clustered, distributed key-value store. A library that does this, while attempting to manage load-balancing across all nodes in the cluster, is going to require some configuration.</p>\n<p>One concern in particular resonated with me, and that was the difficulty in getting CorrugatedIron running inside a REPL, such as <a href=\"http://www.fsharphelp.com/Interactive.aspx\" title=\"F# interactive\">FSI</a>. The two issues with getting a REPL to work from configuration are:</p>\n<ul>\n<li>The ability to specify the location of the configuration file.</li>\n<li>The number of lines of code it takes to wire things in.</li>\n</ul>\n<p>The XML that's required is not going to be changing in the short term. The values that are specified in that configuration are required to make the most of Riak and that's not something we're prepared to compromise on. However, the .NET code required to access it has changed, though the old way of wiring things in still exists for those people who want that level of flexibility.</p>\n<p>In short, you can wire-in CorrugatedIron's XML configuration as simply as:</p>\n<div class=\"pygments_murphy\"><pre><span class=\"n\">var</span> <span class=\"n\">cluster</span> <span class=\"p\">=</span> <span class=\"n\">RiakCluster</span><span class=\"p\">.</span><span class=\"n\">FromConfig</span><span class=\"p\">(</span><span class=\"s\">&quot;riakConfig&quot;</span><span class=\"p\">);</span>\n<span class=\"n\">var</span> <span class=\"n\">client</span> <span class=\"p\">=</span> <span class=\"n\">cluster</span><span class=\"p\">.</span><span class=\"n\">CreateClient</span><span class=\"p\">();</span>\n</pre></div>\n\n<h2 id=\"thats_it\">That's it!</h2>\n<p>Hopefully this will make your life a little easier while dealing with CorrugatedIron. We're always keen to hear your feedback, so please <a href=\"https://github.com/DistributedNonsense/CorrugatedIron\" title=\"CorrugatedIron @ Github\">drop us a line</a> if you have any thoughts, suggestions or issues.</p>\n<p>Enjoy!</p>",
  "isoTimestamp": "2011-08-04T02:18:00.000Z",
  "_id": "2011-08-04T02:18:00.000Z-OJs Rants",
  "site": {
    "feed": "http://buffered.io/feed/index.xml",
    "author": "OJ Reeves",
    "link": "http://buffered.io/"
  },
  "displayDate": "Aug 3 2011"
}