{
  "title": "Riak 1.0 Is Officially Released!",
  "link": "http://blog.basho.com/2011/09/30/Riak-1-dot-0-is-Official",
  "guid": "http://blog.basho.com/2011/09/30/Riak-1-dot-0-is-Official",
  "updated": "2011-09-30T00:00:00+00:00",
  "pubdate": "2011-09-30T07:00:00.000Z",
  "rfc822": "Fri, 30 Sep 2011 00:00:00 -0700",
  "id": "http://blog.basho.com/2011/09/30/Riak-1-dot-0-is-Official",
  "description": "<p><strong>September 30, 2011</strong></p>\n<p>We are absolutely thrilled to report that as of today, Riak 1.0 is officially released and ready for your production applications!</p>\n<p><em><strong>tl;dr</strong></em>: Riak 1.0 packages are available. <a href=\"http://downloads.basho.com/riak/CURRENT/\">Go download one</a>. And <a href=\"https://github.com/basho/riak/blob/1.0/RELEASE-NOTES.org\">then go read the release notes</a>, because they are extensive and full of useful information highlighting the great work Basho has done since the last release.</p>\n<p>There is already a lot of literature out there on the release, so here are the essentials to get you started.</p>\n<h2>The High Level Awesome</h2>\n<p>For those of you who need a refresher on the release, <a href=\"http://riak-onedotoh-preview.heroku.com/\">this 1.0 Slide Deck</a> will give you a quick overview of why you should be excited about it. The big-ticket features are as follows:</p>\n<h3>Secondary Indexing</h3>\n<p>In 1.0 we added the ability to build secondary indexes on your data stored in Riak. We developed this functionality because, quite frankly, people needed a more powerful way to query their data.</p>\n<ul>\n\t<li><a href=\"http://blog.basho.com/2011/09/14/Secondary-Indexes-in-Riak/\">In Depth Blog Post on Secondary Indexes</a></li>\n\t<li><a href=\"http://www.slideshare.net/rklophaus/querying-riak-just-got-easier-introducing-secondary-indices\">High-level Slide Deck</a></li>\n\t<li><a href=\"http://wiki.basho.com/Secondary-Indexes.html\">Official Documentation for Secondary Indexes</a></li>\n</ul>\n<h3>Riak Pipe And Revamped MapReduce</h3>\n<p>Riak&#8217;s MapReduce functionality isn&#8217;t anything new, but we did a lot of work in this release to make the system more robust, performant, and resistant to failures. Riak Pipe is the new underlying processing layer that powers MapReduce, and you&#8217;ll be seeing a lot of cool features and functionality made possible as a result of it in the near future.</p>\n<ul>\n\t<li><a href=\"http://blog.basho.com/2011/09/19/Riak-Pipe-The-New-Map-Reduce-Power/\">Riak Pipe Blog Post</a></li>\n\t<li><a href=\"https://github.com/basho/riak_pipe\">Riak Pipe Code on GitHub</a> (complete with a beautiful <span class=\"caps\">README</span>)</li>\n\t<li><a href=\"http://wiki.basho.com/MapReduce.html\">MapReduce Documentation on the Riak Wiki</a></li>\n</ul>\n<h3>Lager</h3>\n<p>Usability is a huge focus for us right now, and logging is something that&#8217;s less-than-simple to understand in Erlang applications. To that end, we wrote a new logging framework for Erlang/<span class=\"caps\">OTP</span> called Lager that is shipping with 1.0 and drastically reduces the headaches traditionally associated with Erlang logging and debugging.</p>\n<ul>\n\t<li><a href=\"http://blog.basho.com/2011/07/20/Introducing-Lager-A-New-Logging-Framework-for-ErlangOTP/\">Introducing Lager</a> (from the Basho Blog)</li>\n\t<li><a href=\"https://github.com/basho/lager\">Lager Code on GitHub</a></li>\n</ul>\n<h3>Search Integration</h3>\n<p>Riak Search has been a supported Basho product for several releases now, but until 1.0 you were required to build it as a separate package. In 1.0 we&#8217;ve merged the search functionality into Riak proper.  Enabling it is a simple one line change in a configuration file.  Do this and you&#8217;ve got distributed, full text search capabilities on top of Riak</p>\n<ul>\n\t<li><a href=\"http://wiki.basho.com/Riak-Search.html\">Riak Search Documentation on the Riak Wiki</a></li>\n</ul>\n<h3>Support for LevelDB</h3>\n<p>Riak provides for pluggable storage backends, and we are constantly trying to improve the options we offer to our users. Google released LevelDB some months back, and we started to investigate it as a possible addition to our suite of supported backends. After some rigorous testing, what we found is that LevelDB had some attractive functionality and performance characteristics compared to our existing offerings (mainly Innostore), and it will be shipping in 1.0. Bitcask is still the default storage engine, but LevelDB, aside from being an alternative for key/value storage, is being used as the backend behind the new Secondary Indexing functionality.</p>\n<ul>\n\t<li><a href=\"http://blog.basho.com/2011/07/01/Leveling-the-Field/\">Leveling The Field</a> (from the Basho Blog)</li>\n</ul>\n<h3>Cluster Membership</h3>\n<p>One of the most powerful components of Riak is riak_core, the distributed systems framework that, among many others things, enables Riak to scale horizontally. Riak&#8217;s scalability and operational simplicity are of paramount importance to us, and we are constantly looking to make this code and system even better. With that in mind, we did some major work in 1.0 to improve upon our cluster membership system and are happy to report that it&#8217;s now more stable and scalable than ever.</p>\n<ul>\n\t<li><a href=\"http://blog.basho.com/2011/09/09/Riak-Cluster-Membership-Overview/\">Riak Cluster Membership Overview</a> (from the Basho Blog)</li>\n\t<li><a href=\"http://blog.basho.com/2011/04/12/Where-To-Start-With-Riak-Core/\">Where To Start With Riak Core</a> (from the Basho Blog)</li>\n</ul>\n<h3>And So Much More &#8230;</h3>\n<p>Riak 1.0 is a massive accomplishment, and the features and code listed above are just the beginning of what this release has to offer. Take some time to <a href=\"https://github.com/basho/riak/blob/1.0/RELEASE-NOTES.org\">read the lengthy release notes</a> and you&#8217;ll see what we mean.</p>\n<p>These improvements are many months in the making, and the bug fixes, new features, and added functionality make Riak (in our humble opinion) the best open source database available today.</p>\n<h2>Thank You, Community!</h2>\n<p>We did our best to ensure that the community was as big a part of this release as possible, and there&#8217;s no way the code and features would be this rock-solid without your help. Thanks for your usage, support, testing, debugging, and help with spreading the word about Riak and 1.0.</p>\n<p>And 1.0 is just the beginning. We&#8217;ll continue to refine and build Riak over the coming months, and we would love for you to be a part of it if you&#8217;re not already. Some ways to get involved:</p>\n<ul>\n\t<li><a href=\"http://downloads.basho.com/riak/CURRENT\">Download Riak on Your Preferred Platform</a> and then <a href=\"http://wiki.basho.com/Installation.html\">install it</a></li>\n\t<li><a href=\"http://lists.basho.com/mailman/listinfo/riak-users_lists.basho.com\">Join The Riak Mailing List</a> to tell us what you think of the release</li>\n\t<li><a href=\"http://wiki.basho.com/Riak.html\">Read the Riak Wiki</a></li>\n\t<li><a href=\"https://github.com/basho/riak\">Watching Riak on GitHub</a> to stay up-to-date on the latest changes</li>\n\t<li>Tell three friend about the release</li>\n</ul>\n<p>Thanks for being a part of Riak!</p>\n<p><a href=\"http://twitter.com/#!/basho\">The Basho Team</a></p>",
  "isoTimestamp": "2011-09-30T07:00:00.000Z",
  "_id": "2011-09-30T07:00:00.000Z-basho blog",
  "site": {
    "feed": "http://blog.basho.com/feed/index.xml",
    "author": "Basho Technologies",
    "link": "http://blog.basho.com"
  },
  "displayDate": "Sep 30 2011"
}