{
  "entry": "\n   ",
  "title": "Building and Maintaining Community and Culture at a Distributed Company",
  "link": "http://blog.basho.com/2011/06/27/Building-and-Maintaining-Internal-Community-And-Culture",
  "guid": "http://blog.basho.com/2011/06/27/Building-and-Maintaining-Internal-Community-And-Culture",
  "updated": "2011-06-27T00:00:00+00:00",
  "pubdate": "2011-06-27T07:00:00.000Z",
  "rfc822": "Mon, 27 Jun 2011 00:00:00 -0700",
  "id": "http://blog.basho.com/2011/06/27/Building-and-Maintaining-Internal-Community-And-Culture",
  "description": "<p><strong>June 27, 2011</strong></p>\n<p><em>This was originally posted on <a href=\"http://www.themarkphillips.com/2011/06/27/Building-and-Maintaining-Internal-Community-And-Culture.html\">themarkphillips.com</a>. Please use the original post for all comments.</em></p>\n<p>When someone asks me, &#8220;Where is Basho located?&#8221;, I usually respond with something along the lines of: &#8220;Much like <a href=\"http://wiki.basho.com/\">Riak</a>, we are completely distributed.&#8221; Some three years ago our team was all working out of Cambridge, MA (which is still our headquarters). Slowly but surely the team grew in size, but it quickly became apparent that requiring all employees to work in the same geographic location would result in us missing out on some talented and downright brilliant people. So we resolved to &#8220;hire where the talent is.&#8221;</p>\n<p>As it stands right now we have physical offices in Cambridge, MA and <a href=\"http://blog.basho.com/2011/06/07/BashoWest-is-all-new-and-we-have-desks-for-you/\">San Francisco</a>. The team, however, is now completely distributed; in addition to Cambridge and San Francisco (and several other CA cities), we have people in Oregon, Oklahoma (various locations), Florida, Colorado (various locations), New Jersey, North Carolina, Minnesota, Virginia (various locations), Maryland (various locations), Idaho, New York, Germany, and the UK. The latest tally put our entire team at just over thirty people.</p>\n<p>Hiring where the talent is means we don&#8217;t sacrifice great hires for location, but it also presents various hurdles when attempting to build culture and community. Anyone who works at a startup or as part of a small team can speak to the importance of culture. It&#8217;s crucial that distributed employees feel as though they are part of a tight-knit crew. If you show up every day and your engagement with your coworkers doesn&#8217;t go much beyond a few passing phrases in a chat client, you should be doing more.  The leadership at Basho made it clear many moons ago that we were going to work hard to build culture and community. Just because you&#8217;re committing code 1000 miles from your nearest colleague doesn&#8217;t mean you need to feel like they are 1000 miles away.</p>\n<p>I spend most of my time pursuing ways to strengthen and extend the various external communities that are growing out <a href=\"https://github.com/basho/\">Basho&#8217;s open source software</a>, but I thought it might be useful to examine what we do internally to build community and culture. As should be apparent, we&#8217;re not doing anything too crazy or innovative with the ways we connect and collaborate across states and countries. But it&#8217;s the little things that matter when culture is concerned at a distributed company, and I think we do a lot of the little things well.</p>\n<p><strong>Real-Time Chat</strong></p>\n<p>For as long as I can remember, Basho has used <a href=\"http://www.jabber.org/\">Jabber</a> for real-time chat collaboration. This is where we spend most of our time conversing, and the entire company idles in one room we call &#8220;bashochat.&#8221; At any given time you can find any number of conversations happening concurrently; several developers might be chasing down a finicky bug while several others are discussing the merits of the latest cat meme. Hundreds (if not thousands) of messages fly through here daily. At times it can get a bit distracting, so signing off to focus is encouraged and done often. We also just started logging bashochat to make sure that those who are out for the day or signed off to chase a corner case can stay in the loop.</p>\n<p>In addition to Jabber, the Client Services Team also uses <a href=\"http://campfirenow.com\">Campfire</a> as their chat software of choice (for various reasons). There&#8217;s certainly no reason why multiple chat programs can&#8217;t co-exist under the same corporate umbrella. Basho is flexible, and if it works for your team, go with it.</p>\n<p><strong>Skype</strong></p>\n<p>Interacting via <a href=\"http://www.skype.com/\">Skype</a> serves as a great compliment to what happens in Jabber (even if Skype itself offers less than five nines of uptime). Everyone uses Skype at least once daily for our morning status call. We are still small enough where getting the majority of the company on the phone for a 10 minute status call is feasible, so we do it. Topics range from &#8220;What&#8217;s the current status of bug fix X for customer Y?&#8221; to &#8220;Did you get any questions at yesterday&#8217;s meetup talk that you couldn&#8217;t answer?&#8221;  Video chats are also invaluable, and jumping on Skype to speak &#8220;face-to-face&#8221; for even five minutes is incredibly worthwhile and serves to reinforce the team feel (especially when a new hire is coming aboard).</p>\n<p><strong>Yammer</strong></p>\n<p><a href=\"https://www.yammer.com/\">Yammer</a> is a great piece of software, and it recently worked its way into our suite of collaboration tools. When it was first introduced to our team (around the beginning of this year) I was a bit skeptical of how well it was going to work for us. We already use Jabber quite heavily. How would the two co-exist? Since then Yammer has become the home for low-volume, high quality messages that deserve more than just a passing glance or ephemeral response. In other words, the signal to noise ratio in Yammer is much higher; links to blog posts about Riak (or our competition), results of a long running benchmark (complete with graphs), or links to a new GitHub repo are all typical of what appears on Yammer. That said, the message volume has been growing steadily over the past months, and I&#8217;m curious and interested to see how this tool evolves for us.</p>\n<p><strong>Quarterly Meetups</strong></p>\n<p>At some point you have to actually meet and physically interact with your colleagues. To this end, we&#8217;ve been doing quarterly developer meetups for about six quarters now. These are 3-5 day gatherings of the entire team where it&#8217;s business as usual, with the exception of some team building activities scattered throughout the week. (&#8220;Team building&#8221; may sound corny to some, but there&#8217;s nothing quite like cheering for your <a href=\"http://twitter.com/#!/dizzyd\">Director of Engineering</a> as he vies for the best lap time against his team at your neighborhood <a href=\"http://www.gokartracer.com/\">GoKart Racer</a>.) Lots of amazing ideas and and moments are born at these meetups, and we all look forward to them.</p>\n<p><strong>Current Status</strong></p>\n<p>Basho is firing on all cylinders right now (fixing more bugs, writing more features, closing more deals, resolving more tickets, etc.), and I believe that our dedication to building a distributed culture and community internally has had a lot to do with it.  Though Basho&#8217;s &#8220;system&#8221; is still a work in progress, in my opinion we&#8217;ve managed to build a strong internal community and culture that lends itself to heightened levels of productivity and overall happiness. We are still relatively small (right around 30, as I stated above) and making this scale will surely be a challenge. And I&#8217;m sure that the tools we use will change, too, to accommodate our needs (speaking of which, where is the Skype replacement already?).</p>\n<p>You can&#8217;t force community and culture. It starts with how you hire and is tested every day (whether you&#8217;re working in the same physical location or not). Build (or seek out) a team that is committed to making something special across the board. Collaboration tools and processes will follow according, and they should compliment and enhance the way you work, not dictate it.</p>\n<p><em><strong>Update</strong>: <a href=\"http://news.ycombinator.com/item?id=2702616\">Link to Hacker News Comment Thread</a></em></p>\n<p><a href=\"http://twitter.com/#!/pharkmillups\">Mark</a></p>\n<p>Community Manager<br />\n<a href=\"http://www.basho.com/\">Basho Technologies</a></p>",
  "isoTimestamp": "2011-06-27T07:00:00.000Z",
  "_id": "2011-06-27T07:00:00.000Z-basho blog",
  "site": {
    "feed": "http://blog.basho.com/feed/index.xml",
    "author": "Basho Technologies",
    "link": "http://blog.basho.com"
  },
  "displayDate": "Jun 27 2011"
}